Revit 2024 API
BeamSystem.Create Method
Overload List
Name | Description
Create(Document, IList<Curve>, SketchPlane, Int32)
 Creates a 2D BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, XYZ, Boolean)
 Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, Int32, Boolean)
 Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, SketchPlane, XYZ, Boolean)
 Creates a new BeamSystem with specified profile curves.
See Also
BeamSystem Class
BeamSystem Members
Autodesk.Revit.DB Namespace